# Напишите функцию, которая будет принимать номер кредитной карты и
# показывать только последние 4 цифры. Остальные цифры должны заменяться звездочками

card = input('Введите номер карты (16 символов): ')


def num_card():
    return '*' * 14 + card[-4:]


print(num_card())
